Repository: AlexeySpiridonov/loom
Catalog: lib/l10n/app_*.arb
Languages: ru

# language
source: English
ru: Русский

# message1
source: Connect the Extender to an electrical outlet near your main Wi-Fi Router.
ru: Включите LOOM в розетку рядом с основным домашним роутером на расстоянии не более пары метров.

# message2
source: Make sure there are no walls between the Extender and your main Wi-Fi Router.
ru: Убедитесь что между LOOM и основным роутером нет стен, препятствий или бытовой техники.

# message3
source: Switch ON the Extender using the side button. Wait until the LED illuminates.
ru: Включите LOOM боковой кнопкой. Подождите 10 секунд пока загорятся лампочки.

# message4
source: Click on the name of your primary Wi-Fi Network from the list of available Wi-Fi Networks.
ru: Выберите вашу Wi-Fi сеть

# message5
source: Carefully enter your primary Wi-Fi Network's password.
ru: Введите пароль от вашей сети (будьте внимательны)

# message6
source: Name for Extender Wi-Fi
ru: Имя сети LOOM

# message6_1
source: New name for Extender Wi-Fi
ru: Новое имя для LOOM Wi-Fi

# message8
source: Two pop-up boxes will appear. The first asks to connect to your primary Wi-Fi Network. Click 'JOIN' if the correct name appears. The second will display the Wi-Fi Extender's name. Click 'JOIN' if the correct name appears.
ru: Телефон запросит разрешение на подключение к сети, разрешите ему это сделать.

# message9_1
source: Good news! All done!
ru: Настройкам успешно завершена!

# message9_2
source: Home network:
ru: Домашняя сеть

# message9_3
source: Extender Wi-Fi:
ru: Сеть LOOM

# message9_4
source: Now you can move your Network Extender to wherever you need to improve your Wi-Fi signal. Plug it in and wait for the LEDs to indicate a connection.
ru: Теперь можно унести LOOM туда, где нужно улучшить Wi-Fi и включить в розетку.

# message10
source: Home Wi-Fi
ru: Подключится к домашней сети

# message11
source: Extender Wi-Fi
ru: Подключится к сети LOOM

# message12
source: Setup new Extender
ru: Настроить другой LOOM

# message13
source: You need to reset Extender. Hold the Reset button for 10 seconds. Wait until the LED blinks and then becomes steady.
ru: Вам необходимо сбросить настройки устройства. Нажмите и держите кнопку 10 секунд, пока не загорится лампочка.

# message14
source: Home
ru: Домашняя сеть

# message16
source: Check Extender Wi-Fi name
ru: Проверьте имя Loom Wi-Fi

# message15
source: Extender
ru: LOOM сеть

# message17
source: Connect to network 'Wi-Fi Extender'. Press “JOIN” in the pop-up box.
ru: Подключение к сети 'WiFi Extender'...

# message18
source: Scanning for Wi-Fi Networks.
ru: Загрузка списка Wi-Fi сетей

# message19
source: Home Wi-Fi Extender
ru: Wi-Fi extender домашний, твой

# error
source: 000 Unknown error
ru: Неизвестная ошибка

# error101
source: You are not connected to Extender Wi-Fi
ru: Подключено, но не к сети loom

# error102
source: Failed to scan Wi-Fi network
ru: Не получен список wifi сетей

# error103
source: Failed to write settings to Extender
ru: Не удалось записать настройки в репитер

# error104
source: Failed to access the internet. Please сheck the home router settings.
ru: Не удалось получить доступ в интернет

# error105
source: List of Wi-Fi networks not received
ru: Не получен список wifi сетей

# error106
source: The password for the home network does not fit. You need to reset Extender. Hold the Reset button for 10 seconds. Wait until the LED blinks and then becomes steady.
ru: Пароль не подходит, сбросьте роутер и повторите настройку, и картинку сброса.

# startAnew
source: Start over
ru: Начать заново

source: Rescan
ru: Повторить

source: Next
ru: Дальше

source: Save
ru: Ок

source: Connect
ru: Подключиться

# light_on
source: The light is ON
ru: Ок

source: No
ru: Не горят
